'''
程序：猜生肖游戏
作者：苏秦@小海豚科学馆公众号
来源：图书《趣味编程三剑客：从Scratch迈向Python和C++》
'''
def main():
    '''猜生肖游戏'''
    animals = '鼠牛虎兔龙蛇马羊猴鸡狗猪'
    questions = {1:'鼠，虎，龙，马，猴，狗',
                 2:'牛，虎，蛇，马，鸡，狗',
                 4:'兔，龙，蛇，马，猪',
                 8:'羊，猴，鸡，狗，猪'}
    answer = 0
    
    print('************************************')
    print('*               猜生肖              *')
    print('************************************')
    for n in (1, 2, 4, 8):
        print('------------------------------------')
        print(questions[n])
        print('------------------------------------')
        print('请问上面有你的生肖吗？', end='')
        if input('请输入(y/n):') == 'y':
            answer += n
            
    print('================结果=================')
    if 1 <= answer <= 12:
        print('你的生肖是:', animals[answer-1])
    else:
        print('选择不正确，系统无法判断你的生肖。')
    print('====================================')
    return

if __name__ == '__main__':
    main()
